CSCI 2021 Gradebook System
Commands:
  create <name>:          creates a new class with specified name
  class:                  shows the name of the class
  add <name> <score>:     adds a new score
  lookup <name>:          searches for a score by student name
  clear:                  resets current gradebook
  print:                  shows all scores, sorted by student name
  write_text:             saves all scores to text file
  read_text <file_name>:  loads scores from text file
  write_bin:              saves all scores to binary file
  read_bin <file_name>:   loads scores from binary file
  exit:                   exits the program
gradebook> create CSCI4041
gradebook> add Sun 98
gradebook> add Hurley 80
gradebook> add Desmond 92
gradebook> add Miles 80
gradebook> add Eloise 100
gradebook> lookup Eloise
Eloise: 100
gradebook> lookup Locke
No score for 'Locke' found
gradebook> lookup Hurley
Hurley: 80
gradebook> lookup Desmond
Desmond: 92
gradebook> lookup Juliet
No score for 'Juliet' found
gradebook> lookup Miles
Miles: 80
gradebook> lookup Sun
Sun: 98
gradebook> lookup Mei
No score for 'Mei' found
gradebook> exit
